# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'ack'
brew 'awk'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'fzf'
brew 'gifsicle'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq'
brew 'hub'
brew 'imap-uw'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Development
brew 'php'
brew 'composer'
brew 'postgresql'
brew 'nginx'
brew 'node'
brew 'n'
brew 'python'
brew 'python@2'
brew 'redis'
brew 'sqlite'
brew 'argon2'

# Apps
cask 'aerial'
cask 'github'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram-lite'
cask 'vlc'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'LastPass', id: 926036361
mas 'NordVPN', id: 905953485
mas 'Spark', id: 1176895641
mas 'Telegram Lite', id: 946399090
mas 'The Unarchiver', id: 425424353
mas 'Twitter', id: 1482454543
